import { recruitImage, nelsonImage } from 'assets/articles';
import { createEvent, createStore, sample } from 'effector';

//articles for main view

export interface Article {
  title: string;
  image: any;
  text: string;
}
export const articles: Article[] = [
  {
    title: 'Шукаємо експерта!',
    image: recruitImage,
    text: 'Ми розвиваємо ініціативу #ZERO_TORTURE і хочемо, щоб вона стала ефективним майданчиком для взаємодії по попередженню тортур в місцях несвободи. Тож шукаємо експерта, який допоможе нам стати сильнішими 💪',
  },
  {
    title:
      'Запрошуємо на презентацію Комунікаційної стратегії ГО “Україна без тортур”!',
    image: nelsonImage,
    text: 'Місія нашої Організації – це професійне зростання, постійний розвиток та реалізація потенціалу кожного монітора НПМ. Реалізувати цю місію нам, серед іншого, допоможе комунікаційна стратегія, яку ми розробили під час тренінгу за підтримки МФ Відродження та ІСАР Єднання.',
  },
  {
    title: 'Оголошуємо добір до членів Правління ГО “Україна без тортур”',
    image: recruitImage,
    text: 'За статутом нашої Організації Правління повинно складатися з п’яти осіб. Це вкрай важливо для стабільної роботи, особливо в умовах пандемійної невизначеності. У зв’язку з цим нам треба сформувати повний склад Правління Організації для подальшого розвитку. З метою детального інформування членів Організації про кандидатів, затверджено стандартизований перелік документів:',
  },
  {
    title: 'Шукаємо експерта!',
    image: nelsonImage,
    text: 'Ми розвиваємо ініціативу #ZERO_TORTURE і хочемо, щоб вона стала ефективним майданчиком для взаємодії по попередженню тортур в місцях несвободи. Тож шукаємо експерта, який допоможе нам стати сильнішими 💪',
  },
  {
    title:
      'Запрошуємо на презентацію Комунікаційної стратегії ГО “Україна без тортур”!',
    image: recruitImage,
    text: 'Місія нашої Організації – це професійне зростання, постійний розвиток та реалізація потенціалу кожного монітора НПМ. Реалізувати цю місію нам, серед іншого, допоможе комунікаційна стратегія, яку ми розробили під час тренінгу за підтримки МФ Відродження та ІСАР Єднання.',
  },
  {
    title: 'Оголошуємо добір до членів Правління ГО “Україна без тортур”',
    image: nelsonImage,
    text: 'За статутом нашої Організації Правління повинно складатися з п’яти осіб. Це вкрай важливо для стабільної роботи, особливо в умовах пандемійної невизначеності. У зв’язку з цим нам треба сформувати повний склад Правління Організації для подальшого розвитку. З метою детального інформування членів Організації про кандидатів, затверджено стандартизований перелік документів:',
  },
];

export const slideChanged = createEvent<number>();

export const $activeIndex = createStore(0);

sample({
  clock: slideChanged,
  target: $activeIndex,
});
