import {
  articleImage1,
  articleImage2,
  articleImage3,
  articleImage4,
  articleImage5,
  articleImage6,
  articleImage7,
  articleImage8,
} from 'assets/articles';

export const articles = [
  {
    date: '17.02.2023',
    media: articleImage1,
    title: 'Провели тренінг “Перша домедична допомога”',
    subtitle:
      'Навички першої допомоги – критична необхідність для кожної людини, особливо в умовах війни. Сьогодні це,…',
  },
  {
    date: '08.02.2023',
    media: articleImage2,
    title:
      'Єврокомісія допоможе Україні розпочати реформу системи опіки та захисту дітей',
    subtitle:
      'В Україні реформують систему опіки та захисту дітей за допомогою Європейської комісії. Про це повідомив…',
  },
  {
    date: '07.02.2023',
    media: articleImage3,
    title:
      'Російська армія систематично вчиняє воєнні злочини проти дітей під час війни з Україною. Жертвами окупантів стали сотні дітей — соціологи',
    subtitle:
      'Росія і далі порушує норми міжнародного гуманітарного права у війні з Україною, використовуючи заборонені види…',
  },
  {
    date: '06.02.2023',
    media: articleImage4,
    title:
      'Другий всеукраїнський круглий стіл “Кращі практики боротьби з COVID-19 в умовах війни”',
    subtitle:
      'Вже майже як рік триває повномасштабне вторгнення росії в Україну та понад чотири роки –…',
  },
  {
    date: '01.02.2023',
    media: articleImage5,
    title:
      'Більше 4,5 млн українців можуть бути жертвами депортації до РФ та Білорусі — правозахисники.',
    subtitle:
      'Члени коаліції «Україна. П’ята ранку», до якої входить ГО “Україна без тортур”, презентували аналітичний звіт…',
  },
  {
    date: '01.02.2023',
    media: articleImage6,
    title:
      'У Чернівецькому СІЗО виявленні численні порушення прав ув’язнених. ',
    subtitle:
      'Факти порушення вимог тримання ув’язнених у місці несвободи були виявлені співробітниками Департаменту з питань реалізації…',
  },
  {
    date: '30.01.2023',
    media: articleImage7,
    title: 'Російські окупаційні сили вивезли 3,5 тис. українських в’язнів',
    subtitle:
      'З місць позбавлення волі на тимчасово окупованих територіях Запорізької та Херсонської областей російські окупаційні сили…',
  },
  {
    date: '30.01.2023',
    media: articleImage8,
    title:
      'Виплати особам, стосовно яких встановлено факт позбавлення свободи внаслідок збройної агресії проти України',
    subtitle:
      'Особам, стосовно яких встановлено факт позбавлення свободи внаслідок збройної агресії проти України, може бути надана…',
  },
];
